{"url": "us.pressfrom.com/news/entertainment/-144004-what-melanie-griffith-really-thinks-about-daughter-dakota-johnson-dating-chris-martin/", "text": "‘Rampage’ Stomps Past ‘A Quiet Place’ for $34.5 Million Box Office Win Early moviegoers enjoyed Dwayne Johnson's popcorn flick, leading to a strong turnout at Saturday matinee screeningsCritics were mixed about the film, giving it a 51 percent Rotten Tomatoes score. But audiences who went to see the film on Friday night quite enjoyed it, giving it an A- on CinemaScore. TheWrap's Umberto Gonzalez and Beatrice Verhoeven described \"Rampage\" as good, popcorn-munching entertainment, and audiences seem to have agreed with families packing Saturday matinees.\n\n© John Salangsang/BFA/REX/Shutterstock Melanie Griffith Melanie Griffith is over the moon about her daughter Dakota Johnson‘s beau Chris Martin.\n\n\n\nThe Working Girl star, 60, opened up about her daughter’s romance with the Coldplay frontman on Thursday when asked if she gave the Fifty Shades of Grey star any dating advice when it came to her relationship with Martin.\n\n“I adore him!” Griffith said while at the Global Gift Foundation USA Women’s Empowerment Luncheon. “But she is very private about her life and I respect that.”\n\nJohnson and Martin sparked dating rumors after being spotted on a mid-October sushi date in Los Angeles.\n\nBrie Bella on sister's ex John Cena: 'He'll always be family'\n\nBrie Bella slams a report claiming she's \"furious\" at John.Brie Bella has broken her silence in regards to Nikki Bella and John Cena's breakup, and she's supportive of both them, even calling the wrestler-turned-actor \"family.\n\nThe two were “cozy, laughing and affectionate” a source said at the time, adding it was just the two of them enjoying dinner.\n\n© Provided by TIME Inc.\n\nThe spent time together earlier this year while in Malibu with a different source telling PEOPLE, “They had dinner with friends. They also hung out at Chris’ house and went for a beach walk. They didn’t see each other over the holidays and seem to be catching up now.”\n\nMartin and Johnson were later seen grabbing food and drinks at Soho House in Malibu, where they were snapped smiling and laughing together. An eyewitness told PEOPLE, “Chris and Dakota arrived together in Chris’ car. They met up with friends and had a fun night. They both seemed very happy. They were flirty, and also left the restaurant together.”\n\nKhloé Kardashian Reveals Her Nickname for True, Says She's 'Happy & Sad' Baby Is 1-Month-Old\n\nKhloé Kardashian Shares Daughter's Name Days After Giving Birth Amid Cheating Scandal Kris Jenner revealed the meaning behind Khloé’s daughter’s name True — it’s a family name! It’s been one month since Khloé Kardashian welcomed daughter, True, and the Keeping Up with the Kardashians star can’t believe how fast time has flown by. “I can’t believe my baby will be a month old tomorrow,” Kardashian, 33, wrote on Twitter Wednesday. “I can’t believe my baby will be a month old tomorrow,” Kardashian, 33, wrote on Twitter Wednesday.\n\nMore recently, the two attended Ellen DeGeneres’ 60th birthday party together in February. The pair were photographed holding hands as they caught up with Drew Barrymore outside of the bash.\n\nWhile love seems to be in the air for Johnson, it’s also strong with Griffith despite her separation from Antonio Banderas in December 2015.\n\nBanderas told People Now in April even though they were divorced, Griffith “is my family and I will love her until the day I die.”\n\nGriffith tells PEOPLE the feeling is mutual, saying, “I will always love him and he will always love me. We had a great 20 years together.”\n\nAs for how she’ll spend her Mother’s Day this weekend, the mother of three says, “With all the kids and my mom!” Her mother Tippi Hedren, who starred in the Alfred Hitchcock classics The Birds and Marnie, is 88.\n\nRelated video: Antonio Banderas' Heartfelt Words on Ex-Wife Melanie Griffith: 'I'll Love Her Until the Day I Die':", "images": ["https://static.pressfrom.info/upload/images/small/2022/01/10/the-founder-of-black-country-artist-collective-says-its-a-slap-in-the-face-that-morgan-wallen-was-al_322691_.jpg", "https://static.pressfrom.info/upload/images/small/2022/01/13/celebrity-splits-of-2022-stars-who-broke-up-this-year__108249_.jpg", "http://us.pressfrom.com/upload/images/real/2018/05/11/melanie-griffith-standing-posing-for-the-camera__858672_.jpg?content=1", "https://static.pressfrom.info/upload/images/small/2022/01/06/hoeness-will-um-vogt-kampfen__680314_.img", "https://static.pressfrom.info/upload/images/small/2022/01/06/brittany-daniel-reveals-she-had-a-baby-using-her-twin-sister-cynthias-donor-egg__892688_.jpg", "http://us.pressfrom.com/img/no_img/content/no_img_content_flip.jpg", "https://static.pressfrom.info/upload/images/small/2022/01/11/pma-separations-et-recompositions-premier-enfant-plus-tardif-la-fecondite-des-francaises-des-plus-de_321749_.jpg", "https://static.pressfrom.info/upload/images/small/2022/01/05/golden-globes-what-to-know-about-the-2022-awards-that-wont-be-aired-on-tv__926818_.jpg", "http://pressfrom.info/upload/images/real/2018/05/11/what-melanie-griffith-really-thinks-about-daughter-dakota-johnson-dating-chris-martin__606640_.jpg", "http://us.pressfrom.com/img/no_img/flip/no_img_340x220-3.jpg", "http://us.pressfrom.com/img/logo-pressfrom-1.png", "https://static.pressfrom.info/upload/images/small/2022/01/09/josh-duhamel-announces-engagement-to-audra-mari-and-gets-congratulations-from-ex-fergie__310064_.img", "https://static.pressfrom.info/upload/images/small/2022/01/06/halsey-teases-collaboration-with-bad-bunny-it-has-been-discussed__335949_.jpg"], "top_img": "http://pressfrom.info/upload/images/real/2018/05/11/what-melanie-griffith-really-thinks-about-daughter-dakota-johnson-dating-chris-martin__606640_.jpg", "keywords": [], "authors": [], "canonical_link": "http://pressfrom.info/news/entertainment/-144004-what-melanie-griffith-really-thinks-about-daughter-dakota-johnson-dating-chris-martin.html", "title": "Entertainment What Melanie Griffith Really Thinks About Daughter Dakota Johnson Dating Chris Martin", "meta_data": {"theme-color": "#151515", "viewport": "width=device-width, initial-scale=1.0", "og": {"title": "What Melanie Griffith Really Thinks About Daughter Dakota Johnson Dating Chris Martin", "type": "article", "url": "http://pressfrom.info/news/entertainment/-144004-what-melanie-griffith-really-thinks-about-daughter-dakota-johnson-dating-chris-martin.html", "site_name": "PressFrom - US", "description": "‘Rampage’ Stomps Past ‘A Quiet Place’ for &dollar;34.5 Million Box Office Win \n\n \n \t\n\nEarly moviegoers enjoyed Dwayne Johnson's popcorn flick, leading to a strong turnout at Saturday matinee...", "image": "http://pressfrom.info/upload/images/real/2018/05/11/what-melanie-griffith-really-thinks-about-daughter-dakota-johnson-dating-chris-martin__606640_.jpg"}, "description": "What Melanie Griffith Really Thinks About Daughter Dakota Johnson Dating Chris Martin : ‘Rampage’ Stomps Past ‘A Quiet Place’ for &dollar;34.5 Million Box Office Win \n\n \n \t\n\nEarly mov..."}, "movies": [], "publish_date": null, "source": "http://us.pressfrom.com", "summary": ""}