{"url": "www.news.com.au/entertainment/celebrity-life/hook-ups-break-ups/katie-holmes-jamie-foxxs-alleged-secret-romance-explained/news-story/e885965c7da275bc299e39621009dfa9", "text": "HOLLYWOOD’S most secretive Hollywood couple have gone to great lengths to keep their relationship under wraps.\n\nMore from hook ups and break ups\n\nARE they or aren’t they?\n\nKatie Holmes, 39, and Jamie Foxx, 50, have been rumoured to be dating since 2013. The two have kept a low profile, though they have been photographed together.\n\nRead on for a timeline about speculation and moments surrounding the pair.\n\nJuly 2018\n\nHolmes was reportedly spotted in Ireland looking at a wedding venue.\n\nThe actress was seen at the Borris House in County Carlow on July 6 with Suri, 12. The Dawson’s Creek star stayed the night at the venue with her daughter, The Daily Beast reported.\n\n“She was friendly and personable, happy to talk to people and pose for photos, as was Suri,” a source told the outlet.\n\nShe was interested in the house and how it has been used as a wedding venue in the past, sources told The Daily Beast. She has reportedly not booked the home for any event.\n\nA rep for Holmes didn’t respond to Fox News’ request for comment on the reports.\n\nJune 2018\n\nHolmes’ rep denied a report that claimed Foxx and Holmes called off a wedding and had split, according to W, adding that the article was “100 percent untrue.”\n\nFebruary 2018\n\nESPN’s Michael Smith asked Foxx about he and Holmes reportedly shooting some hoops on Valentine’s Day.\n\n“Did you and Katie Holmes play basketball for Valentine’s Day? Like some real ‘Love and Basketball?’” he quipped.\n\nFoxx didn’t comment and took off his headset before walking off.\n\n“Did we lose him?” Smith asked.\n\nJanuary 2018\n\nPhotos published by W show Foxx and Holmes at the same table at a Grammys weekend event. The publication describes the two stars as “the world’s most elusive celebrity couple” and says they were seen “canoodling.”\n\nSeptember 2017\n\nIs this it? Holmes and Foxx set tongues wagging when photos of them on a beach in sunglasses and shades appeared in media reports. Several of the images show the actors holding hands.\n\nMay 2017\n\nUs Weekly published photos of Foxx and Holmes apparently boarding the same plane in Paris. The outlet claims Holmes travelled to the City of Light to see Foxx while he was filming a movie.\n\nApril 2017\n\nA social media user posted a photo of Holmes and Foxx at a New York City restaurant, according to reports.\n\nKatie Holmes and Jamie Foxx spotted together in NYC in April 2017. Picture: Instagram\n\n“Look who I spotted on a date night … @katieholmes212 @iamjamiefoxx I always heard rumours about them but never seen pictures of them until today,” Instagram user @fameolousent_ wrote when sharing the snap.\n\nThe image appears to have been taken down from Instagram.\n\nJune 2016\n\nClaudia Jordan is asked for her thoughts on Foxx being with Holmes while appearing on the “Allegedly … with Theo Von and Matthew Cole Weiss” podcast.\n\n“He is very happy with her, so …” the reality star said. “I like that he seems very happy.”\n\nJordan later told Entertainment Tonight, “I guess people are really wanting someone to confirm this, and I’m sorry but it’s not coming from me. I don’t have the knowledge of this being fact. I misspoke.”\n\nShe then claimed to have no knowledge of the relationship.\n\n“I’ve never seen them together. He’s never told me he’s dating her,” Jordan added.\n\nD ecember 2015\n\nHolmes was a guest at Foxx’s New York City birthday celebration at a French restaurant, according to a photo obtained by TMZ.\n\nThe party reportedly included a performance from American Idol alum Jennifer Hudson.\n\nMay 2015\n\nFoxx spoke out about a February 2015 image which shows him and Holmes holding hands.\n\nEntertainment Tonight described him as saying the photo was out of context and the duo are pals.\n\n“It’s amazing what people will do to sell you out,” he commented at the time.\n\nOctober 2013\n\nFoxx denied he’s dating the Batman Begins actress while speaking with Entertainment Tonight in October 2013.\n\n“[The rumours] are one hundred percent not true,” he insisted. “In fact, it’s quite hilarious because we simply danced at a charity event along with a lot of other people.”\n\nAugust 2013\n\nTheir first sighting: Dancing together in the Hamptons. Picture: Shahar Azran/WireImage\n\nHolmes and Foxx both attended a charity event called Apollo in the Hamptons, where Us Weekly reported that the pair danced on stage together.\n\nPeople also covered the star-filled bash, writing that “at one point, the actress even tried a sip of Foxx’s cocktail.”\n\nThis story originally appeared on Fox News and is republished here with permission. Fox News’ Kathleen Joyce contributed to the report.", "images": ["https://www.news.com.au/wp-content/themes/newscorpau-news-dna/dist/images/logos/news.svg", "https://content.api.news/v3/images/bin/ecb850fd24dc4faf029574216ed57146", "https://content.api.news/v3/images/bin/ef53bcd193354e5bc200de06a424bee8", "https://content.api.news/v3/images/bin/f7a279d110ef5109f8ccf1f3c9b2ebc2"], "top_img": "https://content.api.news/v3/images/bin/ecb850fd24dc4faf029574216ed57146", "keywords": [], "authors": ["Zoe Szathmary", "July"], "canonical_link": "https://www.news.com.au/entertainment/celebrity-life/hook-ups-break-ups/katie-holmes-jamie-foxxs-alleged-secret-romance-explained/news-story/e885965c7da275bc299e39621009dfa9", "title": "Katie Holmes and Jamie Foxx’s relationship timeline", "meta_data": {"HandheldFriendly": "True", "MobileOptimized": 320, "viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "referrer": "origin", "robots": "noarchive", "theme-color": "#ffffff", "application-name": "news", "google-site-verification": "GWTbDFKaKnGKyk3q0Na5jIbWHZ4qXn-ibcfMayjSQA0", "description": "ARE they or aren’t they?", "apple-itunes-app": "app-id=1454481155, app-argument=https://apps.apple.com/au/app/news-com-au/id1454481155", "fb": {"app_id": 113758722003364}, "keywords": "ESPN Inc.,Jamie Foxx,Fox News Channel,Michael W. Smith,Borris House,United States of America,Katie Holmes,North America,Daily Mail,charity event,Jennifer Kate Hudson,Ireland,America,City restaurant,France,actors holding hands,New York,wedding venue,Northern Europe,holding hands,media reports,Europe,Kathleen Joyce,City birthday celebration,elusive celebrity couple,social media user,Western Europe,Northern America,Claudia Jordan,Paris,relationship timeline", "article": {"publisher": "news.com.au — Australia’s leading news site", "author": "Zoe Szathmary", "publicationdate": "2018-07-13T03:46:00.000Z", "section": "News", "published_time": "2018-07-13T03:46:00.000Z", "modified_time": "2018-07-16T04:58:29.000Z"}, "ob": {"article_type": "NON_PREMIUM"}, "articleid": "e885965c7da275bc299e39621009dfa9", "twitter": {"card": "summary_large_image", "site": "@newscomauHQ", "title": "Hollywood’s most secretive romance", "description": "<p>ARE they or aren&rsquo;t they?</p>", "image": "https://content.api.news/v3/images/bin/ecb850fd24dc4faf029574216ed57146"}, "og": {"site_name": "news", "locale": "en_GB", "type": "article", "title": "Inside Katie Holmes and Jamie Foxx’s secret years-long romance", "description": "ARE they or aren’t they?", "category": "News", "url": "https://www.news.com.au/entertainment/celebrity-life/hook-ups-break-ups/katie-holmes-jamie-foxxs-alleged-secret-romance-explained/news-story/e885965c7da275bc299e39621009dfa9", "image": {"identifier": "https://content.api.news/v3/images/bin/ecb850fd24dc4faf029574216ed57146", "width": 1280, "height": 720}}, "vr": {"canonical": "https://www.news.com.au/entertainment/celebrity-life/hook-ups-break-ups/katie-holmes-jamie-foxxs-alleged-secret-romance-explained/news-story/e885965c7da275bc299e39621009dfa9"}}, "movies": ["https://www.youtube.com/embed/bjWg75Q8dcs"], "publish_date": 1531453560.0, "source": "http://www.news.com.au", "summary": ""}